In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv(r"C:\Users\nisho\Documents\nishoak docs\Studies\Machine Learning\Coding_Part\03_Linear_Regression\02_Startups.csv")
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [3]:
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

In [4]:
df.isnull().sum() # No null values are present

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [5]:
df.value_counts()

R&D Spend  Administration  Marketing Spend  State       Profit
0.00       116983.80       45173.06         California  14681.40     1
101913.08  110594.11       229160.95        Florida     146121.95    1
76253.86   113867.30       298664.47        California  118474.03    1
77044.01   99281.34        140574.81        New York    108552.04    1
78013.11   121597.55       264346.06        California  126992.93    1
78389.47   153773.43       299737.29        New York    111313.02    1
86419.70   153514.11       0.00             New York    122776.86    1
91749.16   114175.79       294919.57        Florida     124266.90    1
91992.39   135495.07       252664.93        California  134307.35    1
93863.75   127320.38       249839.44        Florida     141585.52    1
94657.16   145077.58       282574.31        New York    125370.37    1
100671.96  91790.61        249744.55        California  144259.40    1
114523.61  122616.84       261776.23        New York    129917.04    1
0.00       135426.92       0.00             California  42559.73     1
119943.24  156547.42       256512.92        Florida     132602.65    1
120542.52  148718.95       311613.29        New York    152211.77    1
123334.88  108679.17       304981.62        California  149759.96    1
130298.13  145530.06       323876.68        Florida     155752.60    1
131876.90  99814.71        362861.36        New York    156991.12    1
134615.46  147198.87       127716.82        California  156122.51    1
142107.34  91391.77        366168.42        Florida     166187.94    1
144372.41  118671.85       383199.62        New York    182901.99    1
153441.51  101145.55       407934.54        Florida     191050.39    1
162597.70  151377.59       443898.53        California  191792.06    1
75328.87   144135.98       134050.07        Florida     105733.54    1
73994.56   122782.75       303319.26        Florida     110352.25    1
72107.60   127864.55       353183.81        New York    105008.31    1
67532.53   105751.03       304768.73        Florida     108733.99    1
542.05     51743.15        0.00             New York    35673.41     1
1000.23    124153.04       1903.93          New York    64926.08     1
1315.46    115816.21       297114.46        Florida     49490.75     1
15505.73   127382.30       35534.17         New York    69758.98     1
20229.59   65947.93        185265.10        New York    81229.06     1
22177.74   154806.14       28334.72         California  65200.33     1
23640.93   96189.63        148001.11        California  71498.49     1
27892.92   84710.77        164470.71        Florida     77798.83     1
28663.76   127056.21       201126.82        Florida     90708.19     1
28754.33   118546.05       172795.67        California  78239.91     1
38558.51   82982.09        174999.30        California  81005.76     1
44069.95   51283.14        197029.42        California  89949.14     1
46014.02   85047.44        205517.64        New York    96479.51     1
46426.07   157693.92       210797.67        California  96712.80     1
55493.95   103057.49       214634.81        Florida     96778.92     1
61136.38   152701.92       88218.23         New York    97483.56     1
61994.48   115641.28       91131.24         Florida     99937.59     1
63408.86   129219.61       46085.25         California  97427.84     1
64664.71   139553.16       137962.62        California  107404.34    1
65605.48   153032.06       107138.38        New York    101004.64    1
66051.52   182645.56       118148.20        Florida     103282.38    1
165349.20  136897.80       471784.10        New York    192261.83    1
dtype: int64

In [6]:
X = df.iloc[ : , :-1]
y = df.iloc[: , -1]

In [7]:
X.head()

   R&D Spend  Administration  Marketing Spend       State
0  165349.20       136897.80        471784.10    New York
1  162597.70       151377.59        443898.53  California
2  153441.51       101145.55        407934.54     Florida
3  144372.41       118671.85        383199.62    New York
4  142107.34        91391.77        366168.42     Florida

In [8]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

### Encoding the categorical data
##### We can directly do that by,
##### from sklearn.compose import ColumnTransformer
##### from sklearn.preprocessing import OneHotEncoder
##### ct = ColumnTransformer( transformers = [( 'encoder' , OneHotEncoder() , [3] ) ]  , remainder = 'passthrough')
##### X = np.array(ct.fit_transform(X))

In [9]:
# Here state is a categorical feature. We can use one hot encoding to encode that feature.
states = pd.get_dummies(X['State'] , drop_first= True)
# To avoid dummy variable trap we use drop_first = True

In [10]:
X=X.drop('State',axis=1) # Dropping the state column
X=pd.concat([X,states],axis=1) # Concating the dummy variables

In [11]:
X.head() # We can see that 2 new columns have been added

   R&D Spend  Administration  Marketing Spend  Florida  New York
0  165349.20       136897.80        471784.10        0         1
1  162597.70       151377.59        443898.53        0         0
2  153441.51       101145.55        407934.54        1         0
3  144372.41       118671.85        383199.62        0         1
4  142107.34        91391.77        366168.42        1         0

### Splitting the dataset

In [12]:
from sklearn.model_selection import train_test_split
X_train , X_test , y_train , y_test = train_test_split ( X , y , test_size = 0.25 , random_state = 0 )

In [13]:
X_train.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
34   46426.07       157693.92        210797.67        0         0
18   91749.16       114175.79        294919.57        1         0
7   130298.13       145530.06        323876.68        1         0
14  119943.24       156547.42        256512.92        1         0
45    1000.23       124153.04          1903.93        0         1

In [14]:
X_test.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
28   66051.52       182645.56        118148.20        1         0
11  100671.96        91790.61        249744.55        0         0
10  101913.08       110594.11        229160.95        1         0
41   27892.92        84710.77        164470.71        1         0
2   153441.51       101145.55        407934.54        1         0

In [15]:
y_train.head()

34     96712.80
18    124266.90
7     155752.60
14    132602.65
45     64926.08
Name: Profit, dtype: float64

In [16]:
y_test.head()

28    103282.38
11    144259.40
10    146121.95
41     77798.83
2     191050.39
Name: Profit, dtype: float64

### Fitting multiple linear regression to training set

In [17]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
lr.fit(X_train , y_train)

LinearRegression()

In [18]:
y_predicted = lr.predict(X_test)
y_predicted

array([104440.72582616, 132253.81567698, 132872.07174272,  71707.78771428,
       178678.9934985 , 115078.13124331,  66093.9297267 ,  98759.7276409 ,
       114113.5994088 , 167979.49411476,  95786.77295823,  87785.3497979 ,
       110455.98228344])

In [19]:
lr.predict([[66050 , 182650 , 118150 , 1 , 0]])

c:\Users\nisho\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([104439.80243751])

### Calculating the r2 score. If r2 score is nearer to 1 then the model is said to be a good model.

In [20]:
from sklearn.metrics import r2_score
score = r2_score(y_test , y_predicted)
score

0.931581519915206